cmsis-svd/cmsis-svd/data/SiliconLabs/SIM3L1x7_SVD.xml
			</registers>
		</peripheral>
		<peripheral>
			<name>DEVICEID_0</name>
			<version>A</version>
			<description>None</description>
			<groupName>DEVICEID_0</groupName>
			<baseAddress>0x400490c0</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xffc</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<!--BASEPOINTER_START_1-->
				<register>
					<name>DEVICEID0</name>
					<description>Device ID Word 0</description>
					<addressOffset>0x0</addressOffset>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>REVID</name>
							<description>Revision ID. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>REVA</name>
									<description>Revision A.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REVB</name>
									<description>Revision B.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REVC</name>
									<description>Revision C.</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DEVICEID0</name>
							<description>Device ID 0. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>28</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DEVICEID1</name>
					<description>Device ID Word 1</description>
					<addressOffset>0x10</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DEVICEID1</name>
							<description>Device ID 1. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DEVICEID2</name>
					<description>Device ID Word 2</description>
					<addressOffset>0x20</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DEVICEID2</name>
							<description>Device ID 2. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DEVICEID3</name>
					<description>Device ID Word 3</description>
					<addressOffset>0x30</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DEVICEID3</name>
							<description>Device ID 3. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>ECRC_0</name>
			<version>A</version>
			<description>None</description>
			<groupName>ECRC_0</groupName>
			<baseAddress>0x40028000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xffc</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<!--BASEPOINTER_START_1-->
				<register>
					<name>CONTROL</name>
					<description>Module Control</description>
					<addressOffset>0x0</addressOffset>
					<resetValue>0x00000002</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SINITEN</name>
							<description>Seed Initialization Enable. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Do not initialize the CRC module to the value set by the SEED bit.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Initialize the CRC module to the value set by the SEED bit.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SEED</name>
							<description>Seed Setting. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ALL_ZEROES</name>
									<description>CRC seed value is all 0's (0x00000000)</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ALL_ONES</name>
									<description>CRC seed value is all 1's (0xFFFFFFFF).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CRCEN</name>
							<description>CRC Enable. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable CRC operations.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable CRC operations.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>POLYSEL</name>
							<description>Polynomial Selection. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CRC32_FIXED</name>
									<description>Select the fixed 32-bit polynomial: 0x04C11DB7.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CRC16_PROG</name>
									<description>Select the programmable 16-bit polynomial. The POLY register sets the polynomial coefficients.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BMDEN</name>
							<description>Byte Mode Enable. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable byte mode (word/byte width is determined automatically by the hardware).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable byte mode (all writes are considered as bytes).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BBREN</name>
							<description>Byte-Level Bit Reversal Enable. </description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>No byte-level bit reversal (input is same order as written).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Byte-level bit reversal enabled (the bits in each byte are reversed).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ORDER</name>
							<description>Input Processing Order. </description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NO_REORDER</name>
									<description>No byte reorientation (output is same order as input).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BIG_ENDIAN_16</name>
									<description>Swap for 16-bit big endian order (input: B3 B2 B1 B0, output: B2 B3 B0 B1).</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BIG_ENDIAN_32</name>
									<description>Swap for 32-bit big endian order (input: B3 B2 B1 B0, output: B0 B1 B2 B3).</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ASEEDEN</name>
							<description>Automatic Seed Enable. </description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable automatic seeding.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable automatic seeding. Reading the byte of the DATA register selected by ASEEDSEL re-seeds the CRC result with the setting selected by SEED.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ASEEDSEL</name>
							<description>Automatic Seed Byte Select. </description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LSB_READ</name>
									<description>Select a read of the least-significant byte ([7:0]) of DATA, RDATA or BRDATA for automatic re-seeding.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MSB_READ</name>
									<description>Select a read of the most-significant byte [31:24] for 32-bit operations, and [15:8] for 16-bit operations) of DATA, RDATA or BRDATA for automatic re-seeding.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>POLY</name>
					<description>16-bit Programmable Polynomial</description>
					<addressOffset>0x10</addressOffset>
					<resetValue>0x00001021</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>POLY</name>
							<description>16-bit Programmable Polynomial. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DATA</name>
					<description>Input/Result Data</description>
					<addressOffset>0x20</addressOffset>
					<resetValue>0xFFFFFFFF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description>Input/Result Data. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RDATA</name>
					<description>Bit-Reversed Output Data</description>
					<addressOffset>0x30</addressOffset>
					<resetValue>0xFFFFFFFF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RDATA</name>
							<description>Bit-Reversed Output Data. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BRDATA</name>
					<description>Byte-Reversed Output Data</description>
					<addressOffset>0x40</addressOffset>
					<resetValue>0xFFFFFFFF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>BRDATA</name>
							<description>Byte-Reversed Output Data. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SCONTROL</name>
					<description>Bus Snooping Control</description>
					<addressOffset>0x50</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SEN</name>
							<description>Snooping Enable. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable automatic bus snooping.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable automatic bus snooping.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SDIRSEL</name>
							<description>Snooping Direction Select. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>WRITES</name>
									<description>ECRC will snoop writes to the selected peripheral.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>READS</name>
									<description>ECRC will snoop reads from the selected peripheral.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SPERISEL</name>
							<description>Snooping Peripheral Select. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>SADDR</name>
							<description>Snooping Address. </description>
							<bitOffset>18</bitOffset>
							<bitWidth>10</bitWidth>
						</field>
					</fields>
				</register>
