cmsis-svd/cmsis-svd/data/SiliconLabs/SIM3L1x7_SVD.xml
			</registers>
		</peripheral>
		<peripheral>
			<name>EXTOSC_0</name>
			<version>A</version>
			<description>None</description>
			<groupName>Oscillators</groupName>
			<baseAddress>0x4003c000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xffc</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<!--BASEPOINTER_START_1-->
				<register>
					<name>CONTROL</name>
					<description>Oscillator Control</description>
					<addressOffset>0x0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FREQCN</name>
							<description>Frequency Control. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>RANGE0</name>
									<description>Set the external oscillator to range 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RANGE1</name>
									<description>Set the external oscillator to range 1.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RANGE2</name>
									<description>Set the external oscillator to range 2.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RANGE3</name>
									<description>Set the external oscillator to range 3.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RANGE4</name>
									<description>Set the external oscillator to range 4.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RANGE5</name>
									<description>Set the external oscillator to range 5.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RANGE6</name>
									<description>Set the external oscillator to range 6.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RANGE7</name>
									<description>Set the external oscillator to range 7.</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OSCVLDF</name>
							<description>Oscillator Valid Flag. </description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>The external oscillator is unused or not yet stable.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>The external oscillator is running and stable.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OSCMD</name>
							<description>Oscillator Mode. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>OFF</name>
									<description>External oscillator off.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CMOS</name>
									<description>External CMOS clock mode.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CMOSDIV2</name>
									<description>External CMOS with divide by 2 stage.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RC</name>
									<description>RC oscillator mode with divide by 2 stage.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>C</name>
									<description>C oscillator mode with divide by 2 stage.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>XTAL</name>
									<description>Crystal oscillator mode.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>XTALDIV2</name>
									<description>Crystal oscillator mode with divide by 2 stage.</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>PVTOSC_0</name>
			<version>A</version>
			<description>None</description>
			<groupName>Oscillators</groupName>
			<baseAddress>0x4003d000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xffc</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<!--BASEPOINTER_START_1-->
				<register>
					<name>CONTROL</name>
					<description>Module Control</description>
					<addressOffset>0x0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DIGOSCEN</name>
							<description>Digital LDO Oscillator Enable. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the digital LDO PVT oscillator.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the digital LDO PVT oscillator.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MEMOSCEN</name>
							<description>Memory LDO Oscillator Enable. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the memory LDO PVT oscillator.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the memory LDO PVT oscillator.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DIGOSCMD</name>
							<description>Digital LDO Oscillator Mode. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>FAST</name>
									<description>Select fast mode for the digital LDO PVT oscillator.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SLOW</name>
									<description>Select slow mode for the digital LDO PVT oscillator.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MEMOSCMD</name>
							<description>High Voltage Oscillator Mode. </description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>FAST</name>
									<description>Select fast mode for the memory LDO PVT oscillator.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SLOW</name>
									<description>Select slow mode for the memory LDO PVT oscillator.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLKSEL</name>
							<description>Clock Select. </description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>OSCILLATORS</name>
									<description>Select the digital and memory oscillators as the inputs to the clock dividers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AHB</name>
									<description>Select the APB clock as the input to the clock dividers.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
